org/_posts/2016-10-14-favourite-quotes-plato.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Plato 428BC - 348BC"
date: 2016-10-14
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Plato
---
#+END_HTML


- If a man neglects education, he walks lame to the end of his life \\


- The city is what it is because our citizens are what they are


- Wise men talk because they have something to say; fools, because
  they have to say something


- Opinion is the medium between knowledge and ignorance


- Apply youself both now and in the next life. Without effort, you
  cannot be prosperous. Though, the land be good, you cannot have an
  abundant crop without cultivation


- For a mam to conquer himself is the first and noblest of all victories


- The direction in which education starts a man will determine his
  future in life


- Do not train a child to learn by force or harness; but direct them
  to it by what amuses their minds, so that you may be better able to
  discover with accuracy teh peculiar bent of the genious of each


- The highest form of pure thought is in mathematics
