_posts/2016-10-14-favourite-quotes-plato.html
---
layout: post
title: "Plato 428BC - 348BC"
date: 2016-10-14
comments: true
quotes: true
tags: quotes
excerpt: Favourite quotes from Plato
---


<ul class="org-ul">
<li>If a man neglects education, he walks lame to the end of his life</li>

<li>The city is what it is because our citizens are what they are</li>

<li>Wise men talk because they have something to say; fools, because
they have to say something</li>

<li>Opinion is the medium between knowledge and ignorance</li>

<li>Apply youself both now and in the next life. Without effort, you
cannot be prosperous. Though, the land be good, you cannot have an
abundant crop without cultivation</li>

<li>For a mam to conquer himself is the first and noblest of all victories</li>

<li>The direction in which education starts a man will determine his
future in life</li>

<li>Do not train a child to learn by force or harness; but direct them
to it by what amuses their minds, so that you may be better able to
discover with accuracy teh peculiar bent of the genious of each</li>

<li>The highest form of pure thought is in mathematics</li>
</ul>
